//==================================================================
// 《剑指Offer》代码
//==================================================================

// 面试题57（二）：为s的连续正数序列
// 题目：输入一个正数s，打印出所有和为s的连续正数序列（至少含有两个数）。
// 例如输入15，由于1+2+3+4+5=4+5+6=7+8=15，所以结果打印出3个连续序列1～5、
// 4～6和7～8。

#include <iostream>
#include <assert.h>
using namespace std;

//****************************************************************//
//--------------------------打印序列函数--------------------------//
//****************************************************************//
void PrintSequence(int front, int back)
{
	for (int i = front; i <= back; i++)
	{
		cout << i << "\t";
	}
	cout << endl;
}

//****************************************************************//
//----------------------寻找和为s的连续序列-----------------------//
//****************************************************************//
void FindContinueSequence(int sum)
{
	assert(sum >= 3);		//和须大于3，否则不存在这样的序列

	int front = 1, back = 2;	//序列首尾指针初始化
	int currentSum = 3;			//当前序列和初始化

	while (front <= sum / 2)		//当序列首不超过s的一半时
	{
		if (currentSum == sum)		//若当前序列和正好等于s，则打印序列
		{
			PrintSequence(front, back);
			back++;							//序列尾指针加1，继续寻找下一序列，更新当前序列和
			currentSum += back;
		}
			
		else if (currentSum < sum)	//若当前序列和小于s，则使序列尾指针加1，更新当前序列和
		{
			back++;
			currentSum += back;
		}	
		else						//若当前序列和大于s，则使序列首指针加1，更新当前序列和
		{
			currentSum -= front;
			front++;
		}
	}
	cout << "查找结束" << endl << endl;
}

//****************************************************************//
//-----------------------------主函数-----------------------------//
//****************************************************************//
int main()
{
	FindContinueSequence(3);
	FindContinueSequence(4);
	FindContinueSequence(9);
	FindContinueSequence(15);
	FindContinueSequence(100);
	FindContinueSequence(1);

	return 0;
}