//==================================================================
// 《剑指Offer》代码
//==================================================================

// 面试题57（一）：和为s的两个数字
// 题目：输入一个递增排序的数组和一个数字s，在数组中查找两个数，使得它们
// 的和正好是s。如果有多对数字的和等于s，输出任意一对即可。

#include <iostream>
#include <assert.h>
using namespace std;

//**************************************************************************************//
//-------------------------------找到数组中和为s的两个数字------------------------------//
//**************************************************************************************//
bool FindTwoNumbersWithSum(int* array, const int length, int s, int* num1, int* num2)
{
	assert(array != nullptr && length != 0);		//非法输入

	int front = 0, back = length - 1;				//两指针分别指向数组的首尾

	while (front < back)							//当两指针相遇时，退出循环
	{
		if (array[front] + array[back] < s)			//若两数之和小于s，则将较小数字增大
			front++;
		else if (array[front] + array[back] > s)	//若两数之和大于s，则将较大数字减小
			back--;
		else										//若两数之和等于s，则记录两数并返回true
		{
			*num1 = array[front];
			*num2 = array[back];
			return true;
		}
	}
	return false;
}

//**************************************************************************************//
//--------------------------测试用例1：数组中有和为s的两个数字--------------------------//
//**************************************************************************************//
void Test1()
{
	const int length = 6;
	int array[length] = { 1,2,4,7,11,15 };
	int sum = 15;
	int num1, num2;
	if (FindTwoNumbersWithSum(array, length, sum, &num1, &num2))
		cout << "和为 " << sum << " 的两个数字是：" << num1 << " 和 " << num2 << endl;
	else
		cout << "和为 " << sum << " 的两个数字不存在" << endl;
}

//**************************************************************************************//
//-------------------------测试用例2：数组中没有和为s的两个数字-------------------------//
//**************************************************************************************//
void Test2()
{
	const int length = 6;
	int array[length] = { 1,2,4,7,11,15 };
	int sum = 10;
	int num1, num2;
	if (FindTwoNumbersWithSum(array, length, sum, &num1, &num2))
		cout << "和为 " << sum << " 的两个数字是：" << num1 << " 和 " << num2 << endl;
	else
		cout << "和为 " << sum << " 的两个数字不存在" << endl;
}

//**************************************************************************************//
//----------------------------------------主函数----------------------------------------//
//**************************************************************************************//
int main()
{
	Test1();
	Test2();
	return 0;
}