//==================================================================
// 《剑指Offer》代码
//==================================================================

// 面试题61：扑克牌的顺子
// 题目：从扑克牌中随机抽5张牌，判断是不是一个顺子，即这5张牌是不是连续的。
// 2～10为数字本身，A为1，J为11，Q为12，K为13，而大、小王可以看成任意数字。

#include <iostream>
#include <stdlib.h>
#include <assert.h>
using namespace std;

//*********************************************************************//
//-------------------------qsort函数的比较规则-------------------------//
//*********************************************************************//
int compare(const void* p1, const void* p2)
{
	return *(int*)p1 - *(int*)p2;
}

//*********************************************************************//
//-------------------------判断是否是顺子的函数------------------------//
//*********************************************************************//
bool IsContinuous(int* numbers, int length)
{
	assert(numbers != nullptr && length > 0);

	qsort(numbers, length, sizeof(int), compare);	//输入数组排序

	for (int i = 0; i < length - 1; i++)			//若有非零数字重复出现，则一定不是顺子
	{
		if (numbers[i] == numbers[i + 1] && numbers[i] != 0 && numbers[i + 1] != 0)
			return false;
	}

	int index = 0;
	while (numbers[index] == 0)						//统计数组中0的个数
	{
		index++;
	}
	int countZero = index;
	int CountGap = numbers[length - 1] - numbers[index] + 1 - (length - index);	//数组中空缺的总数

	if (CountGap <= countZero)		//若空缺总数小于等于零的个数，则是顺子，否则不是顺子
		return true;
	else
		return false;
}

//*********************************************************************//
//---------------------测试函数1：有大小王，且是顺子-------------------//
//*********************************************************************//
void Test1()
{
	const int length = 5;
	int numbers[length] = { 0,1,3,0,5 };
	if (IsContinuous(numbers, length))
		cout << "是顺子" << endl;
	else
		cout << "不是顺子" << endl;
}

//*********************************************************************//
//---------------------测试函数2：无大小王，且是顺子-------------------//
//*********************************************************************//
void Test2()
{
	const int length = 5;
	int numbers[length] = { 4,8,7,5,6 };
	if (IsContinuous(numbers, length))
		cout << "是顺子" << endl;
	else
		cout << "不是顺子" << endl;
}

//*********************************************************************//
//---------------------测试函数3：有一个王，且是顺子-------------------//
//*********************************************************************//
void Test3()
{
	const int length = 5;
	int numbers[length] = { 3,7,5,6,0 };
	if (IsContinuous(numbers, length))
		cout << "是顺子" << endl;
	else
		cout << "不是顺子" << endl;
}

//*********************************************************************//
//--------------------测试函数4：无大小王，且不是顺子------------------//
//*********************************************************************//
void Test4()
{
	const int length = 5;
	int numbers[length] = { 1,9,5,3,8 };
	if (IsContinuous(numbers, length))
		cout << "是顺子" << endl;
	else
		cout << "不是顺子" << endl;
}

//*********************************************************************//
//--------------------测试函数5：有一个王，且不是顺子------------------//
//*********************************************************************//
void Test5()
{
	const int length = 5;
	int numbers[length] = { 3,12,0,6,8 };
	if (IsContinuous(numbers, length))
		cout << "是顺子" << endl;
	else
		cout << "不是顺子" << endl;
}

//*********************************************************************//
//--------------------------------主函数-------------------------------//
//*********************************************************************//
int main()
{
	Test1();
	Test2();
	Test3();
	Test4();
	Test5();

	return 0;
}